benchmark_results_20251229/axum_heavy.txt
Running 20s test @ http://127.0.0.1:8081/heavy
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   216.55ms   76.28ms 433.40ms   67.82%
    Req/Sec   115.14     20.29   170.00     70.50%
  4611 requests in 20.10s, 5.71GB read
Requests/sec:    229.43
Transfer/sec:    290.78MB